org-latency-results/org_html_report_20251026_230527/statistics.json
{
  "Issuer Certificate Verification" : {
    "transaction" : "Issuer Certificate Verification",
    "sampleCount" : 45,
    "errorCount" : 45,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 0.6043513295729251,
    "receivedKBytesPerSec" : 0.6952401037469783,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 445,
    "errorCount" : 445,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 4.696322093820907,
    "receivedKBytesPerSec" : 5.3964211980898105,
    "sentKBytesPerSec" : 0.0
  },
  "Generator Energy Report" : {
    "transaction" : "Generator Energy Report",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 1.0745409023994499,
    "receivedKBytesPerSec" : 1.2298456421993702,
    "sentKBytesPerSec" : 0.0
  },
  "Buyer Certificate Query" : {
    "transaction" : "Buyer Certificate Query",
    "sampleCount" : 300,
    "errorCount" : 300,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 3.199078665344381,
    "receivedKBytesPerSec" : 3.680190105249688,
    "sentKBytesPerSec" : 0.0
  }
}