org-latency-results/org_html_report_20251026_231239/statistics.json
{
  "Issuer Certificate Verification" : {
    "transaction" : "Issuer Certificate Verification",
    "sampleCount" : 45,
    "errorCount" : 45,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 0.5137866072957697,
    "receivedKBytesPerSec" : 0.5910552962836102,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 445,
    "errorCount" : 445,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 4.652573029713736,
    "receivedKBytesPerSec" : 5.35329741311712,
    "sentKBytesPerSec" : 0.0
  },
  "Generator Energy Report" : {
    "transaction" : "Generator Energy Report",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 1.083670174145797,
    "receivedKBytesPerSec" : 1.2477022805838816,
    "sentKBytesPerSec" : 0.0
  },
  "Buyer Certificate Query" : {
    "transaction" : "Buyer Certificate Query",
    "sampleCount" : 300,
    "errorCount" : 300,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 3.1432043921042707,
    "receivedKBytesPerSec" : 3.6159128651355767,
    "sentKBytesPerSec" : 0.0
  }
}